create_clock -period 10.000 -name s00_axi_aclk -waveform {0.000 5.000} [get_ports s00_axi_aclk]
set_input_delay -clock [get_clocks s00_axi_aclk] -min -add_delay -0.500 [get_ports {s00_axi_araddr[*]}]
set_input_delay -clock [get_clocks s00_axi_aclk] -max -add_delay 0.000 [get_ports {s00_axi_araddr[*]}]
set_input_delay -clock [get_clocks s00_axi_aclk] -min -add_delay -0.500 [get_ports {s00_axi_awaddr[*]}]
set_input_delay -clock [get_clocks s00_axi_aclk] -max -add_delay 0.000 [get_ports {s00_axi_awaddr[*]}]
set_input_delay -clock [get_clocks s00_axi_aclk] -min -add_delay -0.500 [get_ports {s00_axi_wdata[*]}]
set_input_delay -clock [get_clocks s00_axi_aclk] -max -add_delay 0.000 [get_ports {s00_axi_wdata[*]}]
set_input_delay -clock [get_clocks s00_axi_aclk] -min -add_delay -0.500 [get_ports {s00_axi_wstrb[*]}]
set_input_delay -clock [get_clocks s00_axi_aclk] -max -add_delay 0.000 [get_ports {s00_axi_wstrb[*]}]
set_input_delay -clock [get_clocks s00_axi_aclk] -min -add_delay -0.500 [get_ports s00_axi_aresetn]
set_input_delay -clock [get_clocks s00_axi_aclk] -max -add_delay 0.000 [get_ports s00_axi_aresetn]
set_input_delay -clock [get_clocks s00_axi_aclk] -min -add_delay -0.500 [get_ports s00_axi_arvalid]
set_input_delay -clock [get_clocks s00_axi_aclk] -max -add_delay 0.000 [get_ports s00_axi_arvalid]
set_input_delay -clock [get_clocks s00_axi_aclk] -min -add_delay -0.500 [get_ports s00_axi_awvalid]
set_input_delay -clock [get_clocks s00_axi_aclk] -max -add_delay 0.000 [get_ports s00_axi_awvalid]
set_input_delay -clock [get_clocks s00_axi_aclk] -min -add_delay -0.500 [get_ports s00_axi_bready]
set_input_delay -clock [get_clocks s00_axi_aclk] -max -add_delay 0.000 [get_ports s00_axi_bready]
set_input_delay -clock [get_clocks s00_axi_aclk] -min -add_delay -0.500 [get_ports s00_axi_rready]
set_input_delay -clock [get_clocks s00_axi_aclk] -max -add_delay 0.000 [get_ports s00_axi_rready]
set_input_delay -clock [get_clocks s00_axi_aclk] -min -add_delay -0.500 [get_ports s00_axi_wvalid]
set_input_delay -clock [get_clocks s00_axi_aclk] -max -add_delay 0.000 [get_ports s00_axi_wvalid]
set_output_delay -clock [get_clocks s00_axi_aclk] -min -add_delay 0.000 [get_ports {s00_axi_rdata[*]}]
set_output_delay -clock [get_clocks s00_axi_aclk] -max -add_delay 0.000 [get_ports {s00_axi_rdata[*]}]
set_output_delay -clock [get_clocks s00_axi_aclk] -min -add_delay 0.000 [get_ports s00_axi_arready]
set_output_delay -clock [get_clocks s00_axi_aclk] -max -add_delay 0.000 [get_ports s00_axi_arready]
set_output_delay -clock [get_clocks s00_axi_aclk] -min -add_delay 0.000 [get_ports s00_axi_awready]
set_output_delay -clock [get_clocks s00_axi_aclk] -max -add_delay 0.000 [get_ports s00_axi_awready]
set_output_delay -clock [get_clocks s00_axi_aclk] -min -add_delay 0.000 [get_ports s00_axi_bvalid]
set_output_delay -clock [get_clocks s00_axi_aclk] -max -add_delay 0.000 [get_ports s00_axi_bvalid]
set_output_delay -clock [get_clocks s00_axi_aclk] -min -add_delay 0.000 [get_ports s00_axi_rvalid]
set_output_delay -clock [get_clocks s00_axi_aclk] -max -add_delay 0.000 [get_ports s00_axi_rvalid]
set_output_delay -clock [get_clocks s00_axi_aclk] -min -add_delay 0.000 [get_ports s00_axi_wready]
set_output_delay -clock [get_clocks s00_axi_aclk] -max -add_delay 0.000 [get_ports s00_axi_wready]
